content/code/2020-04-10-code-for-kubeadm-on-gcp.org
#+title: Code for Kubernetes Using Kubeadm on GCP
#+date: 2020-04-10T12:39:16-0600
#+publishdate: 2020-04-10T12:39:16-0600
#+draft: t
#+hidden: t
#+tags[]: code
#+description: short post description

# put text for summary prior to 'more' tag

A drill-down into all the scripts used in the blog post

# more

* Clean up comments in generated scripts                           :noexport:
Org-mode includes the option to include comments in the generated code, but those comments
include Org-mode properties, which is not useful in the shell script.  So we are going to
clean those out prior to the shell scripts being written
#+begin_src emacs-lisp :results none
  (defun gjg/trim-property-shelf ()
    "Get rid of all property shelf comments in org babel tangled code"
    (progn
      (replace-regexp "^#[[:space:]]*:PROPERTIES:[[:ascii:]]+?:END:$" "" nil (point-min) (point-max))
      (save-buffer)))

  (add-hook 'org-babel-post-tangle-hook #'gjg/trim-property-shelf)
#+end_src

* Provisioning Compute Resources
  :PROPERTIES:
  :CUSTOM_ID: provisioning-compute-resources
  :END:

The steps here are similar to what you will find in [[https://github.com/kelseyhightower/kubernetes-the-hard-way][Kubernetes the Hard Way]] on GitHub.


** Networking
   :PROPERTIES:
   :CUSTOM_ID: networking
   :END:
*** Virtual Private Cloud Network
    :PROPERTIES:
    :CUSTOM_ID: virtual-private-cloud-network
    :END:

**** Create the =k8sgcp= custom VPC network and subnet:
#+begin_src sh :session k-sh :results none :results none :tangle bin/01-provision-gcp.sh :comments org
  gcloud compute networks create k8sgcp --subnet-mode custom
  gcloud compute networks subnets create kubernetes \
    --network k8sgcp \
    --range 10.240.0.0/24
#+end_src

**** Create the Cloud NAT and Cloud Router for outbound internet access
     We are doing this step because the instances we will provision have no external IP
     addresses.  Setting up Cloud NAT allows those instances to have *outbound* access to
     the internet so that we will be able to install software easily.
#+begin_src sh :session k-sh :results none :tangle bin/01-provision-gcp.sh
gcloud compute routers create k8sgcp-router \
    --network k8sgcp

gcloud compute routers nats create k8sgcp-nat \
    --router=k8sgcp-router \
    --auto-allocate-nat-external-ips \
    --nat-all-subnet-ip-ranges \
    --enable-logging
#+end_src 

*** Firewall Rules
    :PROPERTIES:
    :CUSTOM_ID: firewall-rules
    :END:

**** Create firewall rules
     We want to allow:
     + All internal traffic beween nodes
     + External SSH, ICMP and HTTPS
#+begin_src sh :session k-sh :results none :tangle bin/01-provision-gcp.sh
  # Allow internal
  gcloud compute firewall-rules create k8sgcp-allow-internal \
         --allow tcp,udp,icmp \
         --network k8sgcp \
         --source-ranges 10.240.0.0/24,10.200.0.0/16
  # Allow external SSH, ICMP, HTTPS
  gcloud compute firewall-rules create k8sgcp-allow-external \
         --allow tcp:22,tcp:6443,icmp \
         --network k8sgcp \
         --source-ranges 0.0.0.0/0
#+end_src

#+begin_quote
  An [[https://cloud.google.com/compute/docs/load-balancing/network/][external load balancer]] will be used to expose the Kubernetes API Servers to remote clients.
#+end_quote

List the firewall rules in the =k8sgcp= VPC network:

#+begin_src sh :session k-sh :results output replace 
  gcloud compute firewall-rules list --filter="network:k8sgcp"
#+end_src

To show all fields of the firewall, please show in JSON format: --format=json
To show all fields in table format, please see the examples in --help.

*** Kubernetes Public IP Address
    :PROPERTIES:
    :CUSTOM_ID: kubernetes-public-ip-address
    :END:

