docs/code/2020-04-10-code-for-kubeadm-on-gcp/index.html
<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml"  lang="en">
<head>
<meta charset="UTF-8" />
<meta name="viewport" content="width=device-width, initial-scale=1"/>

<title>Code for Kubernetes Using Kubeadm on GCP | Greg Grubbs | Hype Cyclist</title>

<meta property='og:title' content='Code for Kubernetes Using Kubeadm on GCP - Greg Grubbs | Hype Cyclist'>
<meta property='og:description' content='short post description'>
<meta property='og:url' content='https://hypecyclist.org/code/2020-04-10-code-for-kubeadm-on-gcp/'>
<meta property='og:site_name' content='Greg Grubbs | Hype Cyclist'>
<meta property='og:type' content='article'><meta property='article:section' content='Code'><meta property='article:tag' content='code'><meta property='article:published_time' content='2020-04-10T12:39:16-06:00'/><meta property='article:modified_time' content='2020-04-10T12:39:16-06:00'/><meta name='twitter:card' content='summary'><meta name='twitter:site' content='@gregoryg'><meta name='twitter:creator' content='@gregoryg'>


<link href="https://hypecyclist.org/index.xml" rel="alternate" type="application/rss+xml" title="Greg Grubbs | Hype Cyclist" />

<link rel="stylesheet" href="/css/style.css"/><link rel='stylesheet' href='https://hypecyclist.org/css/custom.css'><link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="manifest" href="/site.webmanifest">
<link rel="mask-icon" href="/safari-pinned-tab.svg" color="#5bbad5">
<link rel="canonical" href="https://hypecyclist.org/code/2020-04-10-code-for-kubeadm-on-gcp/">
<meta name="msapplication-TileColor" content="#da532c">
<meta name="theme-color" content="#ffffff">
</head>
 
<body>

<section class="section">
  <div class="container">
    <nav id="nav-main" class="nav">
      <div id="nav-name" class="nav-left">
        <a id="nav-anchor" class="nav-item" href="https://hypecyclist.org">
          <h1 id="nav-heading" class="title is-4">Greg Grubbs | Hype Cyclist</h1>
        </a>
      </div>
      <div class="nav-right">
        <nav id="nav-items" class="nav-item level is-mobile"><a class="level-item" aria-label="github" href='https://github.com/gregoryg'
            target='_blank' rel='noopener'>
            <span class="icon">
              <i class><svg viewbox='0 0 24 24' stroke-linecap='round' stroke-linejoin='round' stroke-width='2' aria-hidden='true'>
    
    <path d="M9 19c-5 1.5-5-2.5-7-3m14 6v-3.87a3.37 3.37 0 0 0-.94-2.61c3.14-.35 6.44-1.54 6.44-7A5.44 5.44 0 0 0 20 4.77 5.07 5.07 0 0 0 19.91 1S18.73.65 16 2.48a13.38 13.38 0 0 0-7 0C6.27.65 5.09 1 5.09 1A5.07 5.07 0 0 0 5 4.77a5.44 5.44 0 0 0-1.5 3.78c0 5.42 3.3 6.61 6.44 7A3.37 3.37 0 0 0 9 18.13V22"/>
    
  </svg></i>
            </span>
          </a><a class="level-item" aria-label="linkedin" href='https://linkedin.com/in/gregorygrubbs'
            target='_blank' rel='noopener'>
            <span class="icon">
              <i class><svg viewbox='0 0 24 24' stroke-linecap='round' stroke-linejoin='round' stroke-width='2' aria-hidden='true'>
    
    <path stroke-width="1.8" d="m5.839218,4.101561c0,1.211972 -0.974141,2.194011 -2.176459,2.194011s-2.176459,-0.982039 -2.176459,-2.194011c0,-1.211094 0.974141,-2.194011 2.176459,-2.194011s2.176459,0.982917 2.176459,2.194011zm0.017552,3.94922l-4.388022,0l0,14.04167l4.388022,0l0,-14.04167zm7.005038,0l-4.359939,0l0,14.04167l4.360816,0l0,-7.370999c0,-4.098413 5.291077,-4.433657 5.291077,0l0,7.370999l4.377491,0l0,-8.89101c0,-6.915523 -7.829986,-6.66365 -9.669445,-3.259423l0,-1.891237z"/>
    
  </svg></i>
            </span>
          </a></nav>
      </div>
    </nav>

    <nav class="nav">
      

      
      <div class="nav-right"><a class="nav-item" href="/about">
          <h2 class="title is-5">About</h2>
        </a><a class="nav-item" href="/post">
          <h2 class="title is-5">Blog</h2>
        </a></div>
      
    </nav>

  </div>
  <script src="/js/navicon-shift.js"></script>
</section>
<section class="section">
  <div class="container">
    <div class="subtitle tags is-6 is-pulled-right">
      
      
<a class="subtitle is-6" href="/tags/code/">#code</a>




      
    </div>
    <h2 class="subtitle is-6">April 10, 2020</h2>
    <h1 class="title">Code for Kubernetes Using Kubeadm on GCP</h1>
    
    <div class="content">
      <p>
A drill-down into all the scripts used in the blog post</p>
<div id="outline-container-provisioning-compute-resources" class="outline-2">
<h2 id="provisioning-compute-resources">
Provisioning Compute Resources
</h2>
<div id="outline-text-provisioning-compute-resources" class="outline-text-2">
<p>
The steps here are similar to what you will find in <a href="https://github.com/kelseyhightower/kubernetes-the-hard-way">Kubernetes the Hard Way</a> on GitHub.</p>
<div id="outline-container-networking" class="outline-3">
<h3 id="networking">
Networking
</h3>
<div id="outline-text-networking" class="outline-text-3">
<div id="outline-container-virtual-private-cloud-network" class="outline-4">
<h4 id="virtual-private-cloud-network">
Virtual Private Cloud Network
</h4>
<div id="outline-text-virtual-private-cloud-network" class="outline-text-4">
<div id="outline-container-headline-5" class="outline-5">
<h5 id="headline-5">
Create the <code class="verbatim">k8sgcp</code> custom VPC network and subnet:
</h5>
<div id="outline-text-headline-5" class="outline-text-5">
<div class="src src-sh">
<div class="highlight"><pre tabindex="0" style="background-color:#f8f8f8;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-sh" data-lang="sh"><span style="display:flex;"><span>  gcloud compute networks create k8sgcp --subnet-mode custom
</span></span><span style="display:flex;"><span>  gcloud compute networks subnets create kubernetes <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>    --network k8sgcp <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>    --range 10.240.0.0/24</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-6" class="outline-5">
<h5 id="headline-6">
Create the Cloud NAT and Cloud Router for outbound internet access
</h5>
<div id="outline-text-headline-6" class="outline-text-5">
<p>We are doing this step because the instances we will provision have no external IP
     addresses.  Setting up Cloud NAT allows those instances to have <strong>outbound</strong> access to
     the internet so that we will be able to install software easily.</p>
<div class="src src-sh">
<div class="highlight"><pre tabindex="0" style="background-color:#f8f8f8;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-sh" data-lang="sh"><span style="display:flex;"><span>gcloud compute routers create k8sgcp-router <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>    --network k8sgcp
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>gcloud compute routers nats create k8sgcp-nat <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>    --router<span style="color:#666">=</span>k8sgcp-router <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>    --auto-allocate-nat-external-ips <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>    --nat-all-subnet-ip-ranges <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>    --enable-logging</span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-firewall-rules" class="outline-4">
<h4 id="firewall-rules">
Firewall Rules
</h4>
<div id="outline-text-firewall-rules" class="outline-text-4">
<div id="outline-container-headline-8" class="outline-5">
<h5 id="headline-8">
Create firewall rules
</h5>
<div id="outline-text-headline-8" class="outline-text-5">
<p>We want to allow:</p>
<ul>
<li>All internal traffic beween nodes</li>
<li>External SSH, ICMP and HTTPS</li>
</ul>
<div class="src src-sh">
<div class="highlight"><pre tabindex="0" style="background-color:#f8f8f8;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-sh" data-lang="sh"><span style="display:flex;"><span>  <span style="color:#080;font-style:italic"># Allow internal</span>
</span></span><span style="display:flex;"><span>  gcloud compute firewall-rules create k8sgcp-allow-internal <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>         --allow tcp,udp,icmp <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>         --network k8sgcp <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>         --source-ranges 10.240.0.0/24,10.200.0.0/16
</span></span><span style="display:flex;"><span>  <span style="color:#080;font-style:italic"># Allow external SSH, ICMP, HTTPS</span>
</span></span><span style="display:flex;"><span>  gcloud compute firewall-rules create k8sgcp-allow-external <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>         --allow tcp:22,tcp:6443,icmp <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>         --network k8sgcp <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>         --source-ranges 0.0.0.0/0</span></span></code></pre></div>
</div>
<blockquote>
<p>An <a href="https://cloud.google.com/compute/docs/load-balancing/network/">external load balancer</a> will be used to expose the Kubernetes API Servers to remote clients.</p>
</blockquote>
<p>
List the firewall rules in the <code class="verbatim">k8sgcp</code> VPC network:</p>
<div class="src src-sh">
<div class="highlight"><pre tabindex="0" style="background-color:#f8f8f8;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-sh" data-lang="sh"><span style="display:flex;"><span>  gcloud compute firewall-rules list --filter<span style="color:#666">=</span><span style="color:#b44">&#34;network:k8sgcp&#34;</span></span></span></code></pre></div>
</div>
<p>
To show all fields of the firewall, please show in JSON format: –format=json
To show all fields in table format, please see the examples in –help.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-kubernetes-public-ip-address" class="outline-4">
<h4 id="kubernetes-public-ip-address">
Kubernetes Public IP Address
</h4>
