content/code/2020-04-10-code-for-kubeadm-on-gcp.org
**** Allocate a static IP address that will be attached to the external load balancer fronting the Kubernetes API Servers:

#+begin_src sh :session k-sh :results none :tangle bin/01-provision-gcp.sh
  gcloud compute addresses create k8sgcp \
    --region $(gcloud config get-value compute/region)
#+end_src

Verify the =k8sgcp= static IP address was created in your default compute region:

#+begin_src sh :session k-sh :results output replace
  gcloud compute addresses list --filter="name=('k8sgcp')"
#+end_src

** Compute Instances
   :PROPERTIES:
   :CUSTOM_ID: compute-instances
   :END:

The compute instances in this lab will be provisioned using [[https://www.ubuntu.com/server][Ubuntu Server]] 18.04

*** Kubernetes Controllers
    :PROPERTIES:
    :CUSTOM_ID: kubernetes-controllers
    :END:

**** Create three compute instances which will host the Kubernetes control plane:
#+begin_src sh :session k-sh :results none :tangle bin/01-provision-gcp.sh
  CONTROL_INSTANCE_TYPE=n1-standard-2
  for i in 0 1 2; do
      echo $i
      gcloud compute instances create gg-controller-${i} \
             --async \
             --no-address \
             --boot-disk-size 200GB \
             --can-ip-forward \
             --image-family ubuntu-1804-lts \
             --image-project ubuntu-os-cloud \
             --machine-type ${CONTROL_INSTANCE_TYPE} \
             --private-network-ip 10.240.0.1${i} \
             --scopes compute-rw,storage-ro,service-management,service-control,logging-write,monitoring \
             --subnet kubernetes \
             --tags k8sgcp,controller \
             --labels owner=ggrubbs,expiration=48h
  done
#+end_src

List the newly created controller instances
#+begin_src sh :session k-sh :results table replace
gcloud compute instances list --filter="tags.items=k8sgcp AND tags.items=controller"
#+end_src

*** Kubernetes Workers
    :PROPERTIES:
    :CUSTOM_ID: kubernetes-workers
    :END:

Each worker instance requires a pod subnet allocation from the Kubernetes cluster CIDR range. The pod subnet allocation will be used to configure container networking in a later exercise. The =pod-cidr= instance metadata will be used to expose pod subnet allocations to compute instances at runtime.

#+begin_quote
  The Kubernetes cluster CIDR range is defined by the Controller Manager's
  =--cluster-cidr= flag. In this tutorial the cluster CIDR range will be set to
  =10.200.0.0/16=, which supports 254 subnets.
#+end_quote

