docs/code/2020-04-10-code-for-kubeadm-on-gcp/index.html
<div id="outline-text-kubernetes-public-ip-address" class="outline-text-4">
<div id="outline-container-headline-10" class="outline-5">
<h5 id="headline-10">
Allocate a static IP address that will be attached to the external load balancer fronting the Kubernetes API Servers:
</h5>
<div id="outline-text-headline-10" class="outline-text-5">
<div class="src src-sh">
<div class="highlight"><pre tabindex="0" style="background-color:#f8f8f8;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-sh" data-lang="sh"><span style="display:flex;"><span>  gcloud compute addresses create k8sgcp <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>    --region <span style="color:#a2f;font-weight:bold">$(</span>gcloud config get-value compute/region<span style="color:#a2f;font-weight:bold">)</span></span></span></code></pre></div>
</div>
<p>
Verify the <code class="verbatim">k8sgcp</code> static IP address was created in your default compute region:</p>
<div class="src src-sh">
<div class="highlight"><pre tabindex="0" style="background-color:#f8f8f8;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-sh" data-lang="sh"><span style="display:flex;"><span>  gcloud compute addresses list --filter<span style="color:#666">=</span><span style="color:#b44">&#34;name=(&#39;k8sgcp&#39;)&#34;</span></span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-compute-instances" class="outline-3">
<h3 id="compute-instances">
Compute Instances
</h3>
<div id="outline-text-compute-instances" class="outline-text-3">
<p>
The compute instances in this lab will be provisioned using <a href="https://www.ubuntu.com/server">Ubuntu Server</a> 18.04</p>
<div id="outline-container-kubernetes-controllers" class="outline-4">
<h4 id="kubernetes-controllers">
Kubernetes Controllers
</h4>
<div id="outline-text-kubernetes-controllers" class="outline-text-4">
<div id="outline-container-headline-13" class="outline-5">
<h5 id="headline-13">
Create three compute instances which will host the Kubernetes control plane:
</h5>
<div id="outline-text-headline-13" class="outline-text-5">
<div class="src src-sh">
<div class="highlight"><pre tabindex="0" style="background-color:#f8f8f8;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-sh" data-lang="sh"><span style="display:flex;"><span>  <span style="color:#b8860b">CONTROL_INSTANCE_TYPE</span><span style="color:#666">=</span>n1-standard-2
</span></span><span style="display:flex;"><span>  <span style="color:#a2f;font-weight:bold">for</span> i in <span style="color:#666">0</span> <span style="color:#666">1</span> 2; <span style="color:#a2f;font-weight:bold">do</span>
</span></span><span style="display:flex;"><span>      <span style="color:#a2f">echo</span> <span style="color:#b8860b">$i</span>
</span></span><span style="display:flex;"><span>      gcloud compute instances create gg-controller-<span style="color:#b68;font-weight:bold">${</span><span style="color:#b8860b">i</span><span style="color:#b68;font-weight:bold">}</span> <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --async <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --no-address <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --boot-disk-size 200GB <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --can-ip-forward <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --image-family ubuntu-1804-lts <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --image-project ubuntu-os-cloud <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --machine-type <span style="color:#b68;font-weight:bold">${</span><span style="color:#b8860b">CONTROL_INSTANCE_TYPE</span><span style="color:#b68;font-weight:bold">}</span> <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --private-network-ip 10.240.0.1<span style="color:#b68;font-weight:bold">${</span><span style="color:#b8860b">i</span><span style="color:#b68;font-weight:bold">}</span> <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --scopes compute-rw,storage-ro,service-management,service-control,logging-write,monitoring <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --subnet kubernetes <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --tags k8sgcp,controller <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --labels <span style="color:#b8860b">owner</span><span style="color:#666">=</span>ggrubbs,expiration<span style="color:#666">=</span>48h
</span></span><span style="display:flex;"><span>  <span style="color:#a2f;font-weight:bold">done</span></span></span></code></pre></div>
</div>
<p>
List the newly created controller instances</p>
<div class="src src-sh">
<div class="highlight"><pre tabindex="0" style="background-color:#f8f8f8;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-sh" data-lang="sh"><span style="display:flex;"><span>gcloud compute instances list --filter<span style="color:#666">=</span><span style="color:#b44">&#34;tags.items=k8sgcp AND tags.items=controller&#34;</span></span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
