content/code/2020-04-10-code-for-kubeadm-on-gcp.org
**** Create ${NUM_WORKERS} compute instances which will host the Kubernetes worker nodes:
#+begin_src sh :session k-sh :results none :tangle bin/01-provision-gcp.sh
  WORKER_INSTANCE_TYPE=n1-standard-4
  NUM_WORKERS=3
  for i in $(seq 0 $((${NUM_WORKERS} - 1))) ; do
      echo $i
      gcloud compute instances create gg-worker-${i} \
             --async \
             --no-address \
             --boot-disk-size 200GB \
             --can-ip-forward \
             --image-family ubuntu-1804-lts \
             --image-project ubuntu-os-cloud \
             --machine-type ${WORKER_INSTANCE_TYPE} \
             --metadata pod-cidr=10.200.${i}.0/24 \
             --private-network-ip 10.240.0.2${i} \
             --scopes compute-rw,storage-ro,service-management,service-control,logging-write,monitoring \
             --subnet kubernetes \
             --tags k8sgcp,worker \
             --labels owner=ggrubbs,expiration=48h
  done
#+end_src

List the created worker instances
#+begin_src sh :session k-sh :results table replace
gcloud compute instances list --filter="tags.items=k8sgcp AND tags.items=worker"
#+end_src

*** ETCD Cluster Instances
    :PROPERTIES:
    :CUSTOM_ID: kubernetes-workers
    :END:

Each worker instance requires a pod subnet allocation from the Kubernetes cluster CIDR range. The pod subnet allocation will be used to configure container networking in a later exercise. The =pod-cidr= instance metadata will be used to expose pod subnet allocations to compute instances at runtime.

#+begin_quote
  The Kubernetes cluster CIDR range is defined by the Controller Manager's
  =--cluster-cidr= flag. In this tutorial the cluster CIDR range will be set to
  =10.200.0.0/16=, which supports 254 subnets.
#+end_quote

List the created worker instances
#+begin_src sh :session k-sh :results table replace
gcloud compute instances list --filter="tags.items=k8sgcp AND tags.items=worker"
#+end_src
*** Verification
    :PROPERTIES:
    :CUSTOM_ID: verification
    :END:

List the compute instances in your default compute zone:

#+begin_src sh :session k-sh :results output replace
  gcloud compute instances list --filter="tags:k8sgcp"
  gcloud compute instances list --filter="tags.items=k8sgcp AND tags.items=controller" --format="csv(name)[no-heading]" > controller-nodes.txt
  gcloud compute instances list --filter="tags.items=k8sgcp AND tags.items=worker" --format="csv(name)[no-heading]" >  worker-nodes.txt
#+end_src


** Configuring SSH Access
   :PROPERTIES:
   :CUSTOM_ID: configuring-ssh-access
   :END:

SSH will be used to configure the controller and worker instances. When connecting to compute instances for the first time SSH keys will be generated for you and stored in the project or instance metadata as described in the [[https://cloud.google.com/compute/docs/instances/connecting-to-instance][connecting to instances]] documentation.

Test SSH access to the =gg-controller-0= compute instances:

#+begin_src sh :session k-sh :results none
  gcloud compute ssh gg-controller-0
#+end_src

* Cleaning Up
   :PROPERTIES:
   :CUSTOM_ID: cleaning-up
   :END:

 In this lab you will delete the compute resources created during this tutorial.

*** Compute Instances
    :PROPERTIES:
    :CUSTOM_ID: compute-instances
    :END:

**** Delete the controller and worker compute instances:

 #+begin_src sh :session k-sh :results none :tangle bin/99-cleanup-gcp.sh
   gcloud -q compute instances delete \
          $(gcloud compute instances list --filter="tags.items=k8sgcp" --format="csv(name)[no-heading]") \
          --zone $(gcloud config get-value compute/zone)
 #+end_src

*** Networking
    :PROPERTIES:
    :CUSTOM_ID: networking
    :END:

