docs/code/2020-04-10-code-for-kubeadm-on-gcp/index.html
<div id="outline-container-kubernetes-workers" class="outline-4">
<h4 id="kubernetes-workers">
Kubernetes Workers
</h4>
<div id="outline-text-kubernetes-workers" class="outline-text-4">
<p>
Each worker instance requires a pod subnet allocation from the Kubernetes cluster CIDR range. The pod subnet allocation will be used to configure container networking in a later exercise. The <code class="verbatim">pod-cidr</code> instance metadata will be used to expose pod subnet allocations to compute instances at runtime.</p>
<blockquote>
<p>The Kubernetes cluster CIDR range is defined by the Controller Manager&#39;s
  <code class="verbatim">--cluster-cidr</code> flag. In this tutorial the cluster CIDR range will be set to
  <code class="verbatim">10.200.0.0/16</code>, which supports 254 subnets.</p>
</blockquote>
<div id="outline-container-headline-15" class="outline-5">
<h5 id="headline-15">
Create ${NUM_WORKERS} compute instances which will host the Kubernetes worker nodes:
</h5>
<div id="outline-text-headline-15" class="outline-text-5">
<div class="src src-sh">
<div class="highlight"><pre tabindex="0" style="background-color:#f8f8f8;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-sh" data-lang="sh"><span style="display:flex;"><span>  <span style="color:#b8860b">WORKER_INSTANCE_TYPE</span><span style="color:#666">=</span>n1-standard-4
</span></span><span style="display:flex;"><span>  <span style="color:#b8860b">NUM_WORKERS</span><span style="color:#666">=</span><span style="color:#666">3</span>
</span></span><span style="display:flex;"><span>  <span style="color:#a2f;font-weight:bold">for</span> i in <span style="color:#a2f;font-weight:bold">$(</span>seq <span style="color:#666">0</span> <span style="color:#a2f;font-weight:bold">$((</span><span style="color:#b68;font-weight:bold">${</span><span style="color:#b8860b">NUM_WORKERS</span><span style="color:#b68;font-weight:bold">}</span> <span style="color:#666">-</span> <span style="color:#666">1</span><span style="color:#a2f;font-weight:bold">)))</span> ; <span style="color:#a2f;font-weight:bold">do</span>
</span></span><span style="display:flex;"><span>      <span style="color:#a2f">echo</span> <span style="color:#b8860b">$i</span>
</span></span><span style="display:flex;"><span>      gcloud compute instances create gg-worker-<span style="color:#b68;font-weight:bold">${</span><span style="color:#b8860b">i</span><span style="color:#b68;font-weight:bold">}</span> <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --async <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --no-address <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --boot-disk-size 200GB <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --can-ip-forward <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --image-family ubuntu-1804-lts <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --image-project ubuntu-os-cloud <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --machine-type <span style="color:#b68;font-weight:bold">${</span><span style="color:#b8860b">WORKER_INSTANCE_TYPE</span><span style="color:#b68;font-weight:bold">}</span> <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --metadata pod-cidr<span style="color:#666">=</span>10.200.<span style="color:#b68;font-weight:bold">${</span><span style="color:#b8860b">i</span><span style="color:#b68;font-weight:bold">}</span>.0/24 <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --private-network-ip 10.240.0.2<span style="color:#b68;font-weight:bold">${</span><span style="color:#b8860b">i</span><span style="color:#b68;font-weight:bold">}</span> <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --scopes compute-rw,storage-ro,service-management,service-control,logging-write,monitoring <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --subnet kubernetes <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --tags k8sgcp,worker <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>             --labels <span style="color:#b8860b">owner</span><span style="color:#666">=</span>ggrubbs,expiration<span style="color:#666">=</span>48h
</span></span><span style="display:flex;"><span>  <span style="color:#a2f;font-weight:bold">done</span></span></span></code></pre></div>
</div>
<p>
List the created worker instances</p>
<div class="src src-sh">
<div class="highlight"><pre tabindex="0" style="background-color:#f8f8f8;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-sh" data-lang="sh"><span style="display:flex;"><span>gcloud compute instances list --filter<span style="color:#666">=</span><span style="color:#b44">&#34;tags.items=k8sgcp AND tags.items=worker&#34;</span></span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-kubernetes-workers" class="outline-4">
<h4 id="kubernetes-workers">
ETCD Cluster Instances
</h4>
<div id="outline-text-kubernetes-workers" class="outline-text-4">
<p>
Each worker instance requires a pod subnet allocation from the Kubernetes cluster CIDR range. The pod subnet allocation will be used to configure container networking in a later exercise. The <code class="verbatim">pod-cidr</code> instance metadata will be used to expose pod subnet allocations to compute instances at runtime.</p>
<blockquote>
<p>The Kubernetes cluster CIDR range is defined by the Controller Manager&#39;s
  <code class="verbatim">--cluster-cidr</code> flag. In this tutorial the cluster CIDR range will be set to
  <code class="verbatim">10.200.0.0/16</code>, which supports 254 subnets.</p>
</blockquote>
<p>
List the created worker instances</p>
<div class="src src-sh">
<div class="highlight"><pre tabindex="0" style="background-color:#f8f8f8;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-sh" data-lang="sh"><span style="display:flex;"><span>gcloud compute instances list --filter<span style="color:#666">=</span><span style="color:#b44">&#34;tags.items=k8sgcp AND tags.items=worker&#34;</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-verification" class="outline-4">
<h4 id="verification">
Verification
</h4>
<div id="outline-text-verification" class="outline-text-4">
<p>
List the compute instances in your default compute zone:</p>
<div class="src src-sh">
<div class="highlight"><pre tabindex="0" style="background-color:#f8f8f8;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-sh" data-lang="sh"><span style="display:flex;"><span>  gcloud compute instances list --filter<span style="color:#666">=</span><span style="color:#b44">&#34;tags:k8sgcp&#34;</span>
</span></span><span style="display:flex;"><span>  gcloud compute instances list --filter<span style="color:#666">=</span><span style="color:#b44">&#34;tags.items=k8sgcp AND tags.items=controller&#34;</span> --format<span style="color:#666">=</span><span style="color:#b44">&#34;csv(name)[no-heading]&#34;</span> &gt; controller-nodes.txt
</span></span><span style="display:flex;"><span>  gcloud compute instances list --filter<span style="color:#666">=</span><span style="color:#b44">&#34;tags.items=k8sgcp AND tags.items=worker&#34;</span> --format<span style="color:#666">=</span><span style="color:#b44">&#34;csv(name)[no-heading]&#34;</span> &gt;  worker-nodes.txt</span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-configuring-ssh-access" class="outline-3">
<h3 id="configuring-ssh-access">
Configuring SSH Access
</h3>
<div id="outline-text-configuring-ssh-access" class="outline-text-3">
<p>
SSH will be used to configure the controller and worker instances. When connecting to compute instances for the first time SSH keys will be generated for you and stored in the project or instance metadata as described in the <a href="https://cloud.google.com/compute/docs/instances/connecting-to-instance">connecting to instances</a> documentation.</p>
<p>
Test SSH access to the <code class="verbatim">gg-controller-0</code> compute instances:</p>
<div class="src src-sh">
<div class="highlight"><pre tabindex="0" style="background-color:#f8f8f8;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-sh" data-lang="sh"><span style="display:flex;"><span>  gcloud compute ssh gg-controller-0</span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-cleaning-up" class="outline-2">
<h2 id="cleaning-up">
Cleaning Up
</h2>
<div id="outline-text-cleaning-up" class="outline-text-2">
<p>
 In this lab you will delete the compute resources created during this tutorial.</p>
<div id="outline-container-compute-instances" class="outline-4">
<h4 id="compute-instances">
Compute Instances
</h4>
<div id="outline-text-compute-instances" class="outline-text-4">
<div id="outline-container-headline-21" class="outline-5">
<h5 id="headline-21">
Delete the controller and worker compute instances:
</h5>
<div id="outline-text-headline-21" class="outline-text-5">
<div class="src src-sh">
<div class="highlight"><pre tabindex="0" style="background-color:#f8f8f8;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-sh" data-lang="sh"><span style="display:flex;"><span>  gcloud -q compute instances delete <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>         <span style="color:#a2f;font-weight:bold">$(</span>gcloud compute instances list --filter<span style="color:#666">=</span><span style="color:#b44">&#34;tags.items=k8sgcp&#34;</span> --format<span style="color:#666">=</span><span style="color:#b44">&#34;csv(name)[no-heading]&#34;</span><span style="color:#a2f;font-weight:bold">)</span> <span style="color:#b62;font-weight:bold">\
</span></span></span><span style="display:flex;"><span><span style="color:#b62;font-weight:bold"></span>         --zone <span style="color:#a2f;font-weight:bold">$(</span>gcloud config get-value compute/zone<span style="color:#a2f;font-weight:bold">)</span></span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
